src/Catalogs/БонусныеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>БонусныеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидБонусногоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыБонусныхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецБонусногоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Именной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеНачислятьПриОплатеБонусами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОграниченПроцентомСписания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеНачисленийПоСрокуДействия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОграниченийСрокаДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеСписанияПроцент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияНачислений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияНачисленийТип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНачисленияВДеньРождения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонКлиента</Name>
					<Comment>Ключ для оплаты SKLLZZ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Удалить_ПакетУслугСоставУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УслугаСегмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ТипыОграниченийСрокаДействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыОграниченийСрокаДействия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Бессрочный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СрокДействия_С_По</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СрокОграниченПериодом</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/БонусныеСчета/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

// Процедура, обработчик события "ОбработкаЗаполнения" объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	ЭтотОбъект.ДатаОткрытия = ТекущаяДатаСеанса();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ВидыБонусныхСчетов") Тогда 
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "Именной, НеОграниченПроцентомСписания, ОграничениеНачисленийПоСрокуДействия, ОграничениеСписанияПроцент, СрокДействияНачислений, СрокДействияНачисленийТип, СуммаНачисленияВДеньРождения, НеНачислятьПриОплатеБонусами");
		
		ЭтотОбъект.Закрыт            = Ложь;
		ЭтотОбъект.ДатаОткрытия      = ТекущаяДата();
		ЭтотОбъект.ВидБонусногоСчета = ДанныеЗаполнения.Ссылка;
		Справочники.БонусныеСчета.ЗаполнитьСрокДействияБонусногоСчета(ДанныеЗаполнения.Ссылка, ДатаОткрытия, СрокДействияНачало, СрокДействияКонец);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда 
		
		//Если ДанныеЗаполнения.Свойство("СтруктураДанныхПриПроведенииДенежныхСредств") Тогда 
		//	ВидБонусногоСчета 	= ДанныеЗаполнения.СтруктураДанныхПриПроведенииДенежныхСредств.ВидБонусногоСчета;
		//	Контрагент 			= ДанныеЗаполнения.СтруктураДанныхПриПроведенииДенежныхСредств.Владелец;
		//	Карта 				= ?(ЗначениеЗаполнено(ДанныеЗаполнения.СтруктураДанныхПриПроведенииДенежныхСредств.Сертификат), ДанныеЗаполнения.СтруктураДанныхПриПроведенииДенежныхСредств.Сертификат, Справочники.Номенклатура.ПустаяСсылка());			
		//	Если ЗначениеЗаполнено(ВидБонусногоСчета) Тогда
		//		// Заполним табличную часть ПакетУслуг
		//		ПакетУслугСоставУслуг.Загрузить(ВидБонусногоСчета.ПакетУслугСоставУслуг.Выгрузить());
		//		// Заполним срок действия лицевого счета
		//		Справочники.БонусныеСчета.ЗаполнитьСрокДействияБонусногоСчета(ВидБонусногоСчета, ДатаОткрытия, СрокДействияНачало, СрокДействияКонец);
		//	КонецЕсли;
		//	// Сформируем наименование лицевого счета
		//	Справочники.БонусныеСчета.СформироватьНаименование(Наименование, ВидБонусногоСчета);
		//КонецЕсли;
		
	КонецЕсли;
	
	ЭтотОбъект.Наименование = Справочники.БонусныеСчета.СформироватьНаименование(Код, ВидБонусногоСчета, ВладелецБонусногоСчета);
		
КонецПроцедуры

// Процедура, обработчик события "ПередЗаписью" объекта.
//
Процедура ПередЗаписью(Отказ)
	
	Если ЭтоНовый() 
		И НЕ ЗначениеЗаполнено(ЭтотОбъект.Код) Тогда
		
		ЭтотОбъект.УстановитьНовыйКод();
	КонецЕсли;

	Если ЭтоНовый() 
		И НЕ ЭтоГруппа Тогда
		// Необходимо для создания приветственных начислений
		ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	КонецЕсли;
	
	УстановитьНастройкиОграничений();	
	ЭтотОбъект.Наименование = Справочники.БонусныеСчета.СформироватьНаименование(Код, ВидБонусногоСчета, ВладелецБонусногоСчета);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//
//
Процедура УстановитьНастройкиОграничений()
	
	Если ЭтотОбъект.НеОграниченПроцентомСписания Тогда 
		ЭтотОбъект.ОграничениеСписанияПроцент = 0;
	ИначеЕсли ЭтотОбъект.ОграничениеСписанияПроцент = 0 Тогда 
		ЭтотОбъект.НеОграниченПроцентомСписания = Истина;
	КонецЕсли;		
	
	// Бессрочный
	Если ЭтотОбъект.ОграничениеНачисленийПоСрокуДействия = Перечисления.ТипыОграниченийСрокаДействия.Бессрочный Тогда		
		
		ЭтотОбъект.СрокДействияНачислений 		= 0;
		ЭтотОбъект.СрокДействияНачисленийТип 	= Перечисления.Периодичность.ПустаяСсылка();		
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
